![png](Data/books.png)

In [14]:
#importing libraries
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
import json
from urllib.parse import quote_plus as urlquote
from sqlalchemy_utils import create_database, database_exists

In [15]:
with open("/Users/echo/.secret/mysql.json") as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [16]:
#When using an f-string you have to use single quotes for username and password
db_name = "books"
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/{db_name}"
engine = create_engine(connection)

In [ ]:
create_database(connection)

In [ ]:
sql = """
CREATE DATABASE books;
"""
pd.read_sql(sql, engine)
#this gives me an error but still creates the table

In [ ]:
sql = '''
CREATE TABLE users
(id INT PRIMARY KEY AUTO_INCREMENT);
'''
pd.read_sql(sql, engine)
#this gives me an error but still creates the table

# Import Users CSV

In [20]:
#Reading in users table to df
users = pd.read_csv("Data/users.csv")
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

# Users DF to SQL

In [22]:
#pushing user table and its contents to sql
#table name is within parenthesis
users.to_sql('users', engine, if_exists = 'replace')

3

# Import Book Titles CSV

In [23]:
#Reading in title table to df
book_titles = pd.read_csv("Data/title.csv")
book_titles

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

# Book Titles DF to SQL

In [24]:
#pushing book_titles table and its contents to sql
#table name is within parenthesis
book_titles.to_sql("book_titles", engine, if_exists = "replace")

6

# Import Authors CSV

In [26]:
#Reading in Authors table to df
authors = pd.read_csv("Data/authors.csv")
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

# Authors DF to SQL

In [27]:
#pushing authors table and its contents to sql
#table name is within parenthesis
authors.to_sql("authors", engine, if_exists="replace" )

5

# Import Favorites CSV

In [28]:
#Reading in favorites table to df
favs = pd.read_csv("Data/favorites.csv")
favs.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

# Favorites DF to SQL

In [29]:
#pushing favs table and its contents to sql
#table name is within parenthesis
favs.to_sql("favorites", engine, if_exists="replace")

7

In [30]:
#Reading tables from SQL
sql = """
SHOW TABLES
FROM books;
"""
pd.read_sql(sql, engine)

  Tables_in_books
0         authors
1     book_titles
2       favorites
3           users

# John's Fav Books

In [38]:
#list the titles of all of John Doe's favorite books
sql = """
SELECT b.title, favs.user_id
FROM book_titles b
JOIN favorites favs
ON b.id = favs.book_id
JOIN users u
ON u.id = favs.user_id
WHERE u.first_name = "John";
"""
pd.read_sql(sql, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1